RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_xrdc2.h
/*
 * Copyright 2019-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_XRDC2_H_
#define _FSL_XRDC2_H_

#include "fsl_common.h"

/*!
 * @addtogroup xrdc2
 * @{
 */

/******************************************************************************
 * Definitions
 *****************************************************************************/
/*! @brief Driver version. */
#define FSL_XRDC2_DRIVER_VERSION (MAKE_VERSION(2, 0, 2))

/* Definitions for XRDC2 Exclusive access lock. */
#define XRDC2_EAL_FORCE_RELEASE_MAGIC_0 0x02000046UL
#define XRDC2_EAL_FORCE_RELEASE_MAGIC_1 0x02000052UL

#define XRDC2_EAL_DISABLE             (0UL << XRDC2_MSC_MSAC_W1_EAL_SHIFT)
#define XRDC2_EAL_DISABLE_UNTIL_RESET (1UL << XRDC2_MSC_MSAC_W1_EAL_SHIFT)
#define XRDC2_EAL_UNLOCKED            (2UL << XRDC2_MSC_MSAC_W1_EAL_SHIFT)
#define XRDC2_EAL_LOCKED              (3UL << XRDC2_MSC_MSAC_W1_EAL_SHIFT)

#define XRDC2_EAL_MASK XRDC2_MSC_MSAC_W1_EAL_MASK

/*!
 * @brief Global configuration lock.
 */
typedef enum _xrdc2_global_config_lock
{
    kXRDC2_GlobalConfigLockDisabled,           /*!< Lock disabled, registers can be written by any domain. */
    kXRDC2_GlobalConfigLockDisabledUntilReset, /*!< Lock disabled until the next reset. */
    kXRDC2_GlobalConfigLockOwnerOnly,          /*!< Lock enabled, only the lock owner can write. */
    kXRDC2_GlobalConfigLockEnabledUntilReset   /*!< Lock enabled, all registers are read only until the next reset. */
} xrdc2_global_config_lock_t;

/*!
 * @brief XRDC2 secure attribute, the register bit MDACi_MDAj_W0[SA],
 * secure/nonsecure attribute output on a hit.
 */
typedef enum _xrdc2_secure_attr
{
    kXRDC2_MasterSecure   = 0, /*!< Use the bus master's secure/nonsecure attribute directly. */
    kXRDC2_ForceSecure    = 2, /*!< Force the bus attribute for this master to secure.        */
    kXRDC2_ForceNonSecure = 3, /*!< Force the bus attribute for this master to non-secure.    */
} xrdc2_secure_attr_t;

/*!
 * @brief XRDC2 privileged attribute, the register bit MDACi_MDAj_W0[PA],
 * defines the privileged/user attribute on a hit.
 */
typedef enum _xrdc2_privilege_attr
{
    kXRDC2_MasterPrivilege = 0, /*!< Use the bus master's attribute directly. */
    kXRDC2_ForceUser       = 2, /*!< Force the bus attribute for this master to user.       */
    kXRDC2_ForcePrivilege  = 3, /*!< Force the bus attribute for this master to privileged. */
} xrdc2_privilege_attr_t;

/*!
 * @brief Domain assignment for the bus master.
 *
 * XRDC2 compares the bus master @e match @e input with the parameter @ref mask
 * and @ref match in this structure. If hit, the domain ID, privilege attribute,
 * and secure attribute are used for the access.
 */
typedef struct _xrdc2_master_domain_assignment
{
    bool lock;                            /*!< Set true to lock the descriptor. */
    xrdc2_privilege_attr_t privilegeAttr; /*!< Privilege attribute. */
    xrdc2_secure_attr_t secureAttr;       /*!< Secure attribute. */
    uint8_t domainId;                     /*!< Domain ID used when this descriptor hit. */
    uint16_t mask;                        /*!< Mask used for descriptor hit. */
    uint16_t match;                       /*!< Match used for descriptor hit. */
} xrdc2_master_domain_assignment_t;

/*!
 * @brief XRDC2 domain access control policy.
 */
typedef enum _xrdc2_access_policy
{
    /*                               policy SecurePriv  SecureUser  NonSecurePriv  NonSecureUsr */
    kXRDC2_AccessPolicyNone = 0U, /*  000      none        none        none            none     */
    kXRDC2_AccessPolicyAlt1 = 1U, /*  001      r             r         none            none     */
    kXRDC2_AccessPolicyAlt2 = 2U, /*  010      r,w         none        none            none     */
    kXRDC2_AccessPolicyAlt3 = 3U, /*  011      r,w          r,w        none            none     */
    kXRDC2_AccessPolicyAlt4 = 4U, /*  100      r,w          r,w         r              none     */
    kXRDC2_AccessPolicyAlt5 = 5U, /*  101      r,w          r,w         r                r      */
    kXRDC2_AccessPolicyAlt6 = 6U, /*  110      r,w          r,w         r,w            none     */
    kXRDC2_AccessPolicyAll  = 7U  /*  111      r,w          r,w         r,w             r,w     */
} xrdc2_access_policy_t;

/*!
 * @brief Access configuration lock mode, the register field PDAC and MRGD LK2.
 */
typedef enum _xrdc2_access_config_lock
{
    kXRDC2_AccessConfigLockDisabled           = 0U, /*!< Entire PDACn/MRGDn/MSC can be written.       */
    kXRDC2_AccessConfigLockDisabledUntilReset = 1U, /*!< Entire PDACn/MRGDn/MSC can be written until next reset. */
    kXRDC2_AccessConfigLockDomainXOnly        = 2U, /*!< Domain x only write the DxACP field.     */
    kXRDC2_AccessConfigLockEnabledUntilReset  = 3U  /*!< PDACn/MRGDn/MSC is read-only until the next reset. */
} xrdc2_access_config_lock_t;

/*!
 * @brief XRDC2 peripheral domain access control configuration.
 */
typedef struct _xrdc2_periph_access_config
{
    xrdc2_access_config_lock_t lockMode;                          /*!< PDACn lock configuration.      */
    xrdc2_access_policy_t policy[FSL_FEATURE_XRDC2_DOMAIN_COUNT]; /*!< Access policy for each domain. */
} xrdc2_periph_access_config_t;

/*!
 * @brief XRDC2 memory region domain access control configuration.
 */
typedef struct _xrdc2_mem_access_config
{
    uint32_t startAddr;                  /*!< Memory region start address, should be 4k aligned. */
    uint32_t endAddr;                    /*!< Memory region end address, (endAddr + 1) should be 4k aligned. */
    xrdc2_access_config_lock_t lockMode; /*!< MRGDn lock configuration.      */
    xrdc2_access_policy_t policy[FSL_FEATURE_XRDC2_DOMAIN_COUNT]; /*!< Access policy for each domain. */
} xrdc2_mem_access_config_t;

/*!
 * @brief XRDC2 memory slot domain access control configuration.
 */
typedef struct _xrdc2_mem_slot_access_config
{
    xrdc2_access_config_lock_t lockMode;                          /*!< Descriptor lock configuration.      */
    xrdc2_access_policy_t policy[FSL_FEATURE_XRDC2_DOMAIN_COUNT]; /*!< Access policy for each domain. */
} xrdc2_mem_slot_access_config_t;

